const data = {

    "Аниме": {

        "Романтика": [
            "Your Name",
            "Toradora!",
            "Clannad"
        ],

        "Драма": [
            "Violet Evergarden",
            "Anohana",
            "Erased"
        ],

        "Sci-Fi": [
            "Steins;Gate",
            "Psycho-Pass",
            "Cowboy Bebop"
        ]

    },


    "Фильмы": {

        "Детектив": [
            "Воспоминания об убийстве (2003)",
            "Враг (2013)",
            "Девушка с татуировкой дракона (2011)",
            "Дело №39 (2007)",
            "Деловая женщина (1988)",
            "Зодиак (2007)",
            "Иллюзия полёта (2005)",
            "Найди ключ (2002)",
            "Окно во двор (1954)",
            "Остров проклятых (2010)",
            "Перелом (2007)",
            "Пленницы (2013)",
            "Пленницы (2013)",
            "Семь (1995)"
        ],

        "Драма": [
            "Андрей Рублёв (1966)",
            "Асса (1987)",
            "Баффало 66 (1998)",
            "Вкус жизни (2007)",
            "Всё ещё Элис (2014)",
            "Все умрут, а я останусь (2008)",
            "Вселенная Стивена Хокинга (2014)",
            "Выстрел в пустоту (2017)",
            "Географ глобус пропил (2013)",
            "Горбатая гора (2005)",
            "Дети Ленинграда (2005)",
            "Джули и Джулия: Готовим счастье по рецепту (2009)",
            "Женщины (2008)",
            "Зал самоубийц (2011)",
            "Замок (1994)",
            "Звук свободы (2023)",
            "Здоровый человек (2022)",
            "Игла (1988)",
            "Искупление (2007)",
            "Кавказский пленник (1996)",
            "Калина красная (1974)",
            "Комната (2015)",
            "Лиля навсегда (2002)",
            "Манк (2020)",
            "Маска (1985)",
            "Материнский инстинкт (2024)",
            "Между нами музыка (2017)",
            "Месть от кутюр (2015)",
            "Мосты округа Мэдисон (1995)",
            "Надежда (2013)",
            "Один день (2011)",
            "Пожары (2010)",
            "Прислуга (2011)",
            "Проект «Флорида» (2017)",
            "Разрушение (2015)",
            "Реквием по мечте (2000)",
            "Сволочи (2006)",
            "Слепота (2008)",
            "Социальная сеть (2010)",
            "Станция «Фрутвейл» (2013)",
            "Точка кипения (2021)",
            "Точка кипения (2021)",
            "Три истории (1997)",
            "Ущерб (1992)",
            "Французский вестник. Приложение к газете «Либерти. Канзас ивнинг сан» (2021)",
            "Человек дождя (1988)",
            "Человек, который удивил всех (2018)",
            "Эрин Брокович (2000)",
            "Я - Сэм (2001)"
        ],

        "Комедия": [
            "10 причин моей ненависти (1999)",
            "Американский пирог": [
                "Американский пирог (1999)",
                "Американский пирог 2 (2001)",
                "Американский пирог: Свадьба (2003)",
                "Американский пирог: Все в сборе (2012)"
],
            "Афера доктора Нока (2017)",
            "Безумно богатые азиаты (2018)",
            "Блондинка в законе": [
                "Блондинка в законе (2001)",
                "Блондинка в законе 2: Красное, белое и блондинка (2003)"
],
            "Братья из Гримсби (2016)",
            "Бунтарка (2006)",
            "Быстрее пули (2022)",
            "Гарольд и Кумар уходят в отрыв (2004)",
            "Городские девчонки (2003)",
            "Двое: Я и моя тень (1995)",
            "Джей и Молчаливый Боб наносят ответный удар (2001)",
            "Доброе утро (2010)",
            "Дрянные девчонки (2004)",
            "Дьявол носит Prada (2006)",
            "Евротур (2004)",
            "Ещё по одной (2020)",
            "Звезда сцены (2004)",
            "Идеальный мужчина (2005)",
            "Из 13 в 30 (2004)",
            "Король вечеринок": [
                "Король вечеринок (2001)",
                "Король вечеринок 2: Восхождение Таджа (2006)",
                "Король вечеринок 3: Год первокурсника (2009)"
],
            "Красотки в молоке (2006)",
            "Кролик Джоджо (2019)",
            "Куда ты пропала, Бернадетт? (2019)",
            "Ловушка для родителей (1998)",
            "Лучшее впереди (2019)",
            "Мгновения Нью-Йорка (2004)",
            "Муравьи в штанах": [
                "Муравьи в штанах (2000)",
                "Новые муравьи в штанах (2002)",
                "Муравейник в штанах (2023)"
],
            "Не смотрите наверх (2021)",
            "Недетское кино (2001)",
            "Неуместный человек (2006)",
            "Окно в Париж (1993)",
            "Она — мужчина (2006)",
            "Осенний марафон (1979)",
            "Очень страшное кино": [
                "Очень страшное кино (2000)",
                "Очень страшное кино 2 (2001)",
                "Очень страшное кино 3 (2003)",
                "Очень страшное кино 4 (2006)",
                "Очень страшное кино 5 (2013)",
                "Очень страшное кино (2026)"
],
            "Папохищение (2009)",
            "Паспорт в Париж (1999)",
            "Пит в перьях (2009)",
            "Полетта (2012)",
            "Рот на замок (2000)",
            "Рыцари справедливости (2020)",
            "Секрет моего успеха (1987)",
            "Смокинг (2002)",
            "Солнечные каникулы (2001)",
            "Стажёр (2015)",
            "Страна ОЗ (2015)",
            "Сумасшедшие гонки (2005)",
            "Читай и рыдай (2006)",
            "Школа рока (2003)",
            "Шопоголик (2009)",
            "Я ругаюсь (2025)"
        ],

        "Романтика": [
            "27 свадеб (2008)",
            "50 первых поцелуев (2004)",
            "Варенье из инжира (2011)",
            "Голая правда (2009)",
            "Дневник Бриджит Джонс": [
                "Дневник Бриджит Джонс (2001)",
                "Бриджит Джонс: Грани разумного (2004)",
                "Бриджит Джонс 3 (2016)",
                "Бриджит Джонс. Без ума от мальчишки (2025)"
],
            "Дневник памяти (2004)",
            "Дневники принцессы": [
                "Дневники принцессы (2001)",
                "Дневники принцессы 2: Как стать королевой (2004)"
],
            "До встречи с тобой (2016)",
            "Как выйти замуж за 3 дня (2010)",
            "Как отделаться от парня за 10 дней (2003)",
            "Краденое свидание (2015)",
            "Красотка (1990)",
            "Красотка (1990)",
            "Лучшее во мне (2014)",
            "Любовь и другие лекарства (2010)",
            "Любовь с уведомлением (2002)",
            "Отпуск по обмену (2006)",
            "План Б (2010)",
            "Поцелуй на удачу (2006)",
            "Правила съёма: Метод Хитча (2005)",
            "Предложение (2009)",
            "С любовью, Рози (2014)",
            "С любовью, Рози (2014)",
            "Свадебный переполох (2001)",
            "Эта дурацкая любовь (2011)"
        ],

        "Триллер": [
            "Бойцовский клуб (1999)",
            "Бэтмен (2022)",
            "Власть страха (1999)",
            "Время убивать (1996)",
            "Выживание (2024)",
            "Двойной просчёт (1999)",
            "Довод (2020)",
            "Игра (1997)",
            "Игры дьявола (2007)",
            "Исчезнувшая (2014)",
            "Комната страха (2002)",
            "Кровопускатель (1999)",
            "Кто не спрятался (2020)",
            "Лучшее предложение (2013)",
            "Люси (2014)",
            "Молчание ягнят": [
                "Ганнибал: Восхождение (2007)",
                "Красный дракон (2002)",
                "Молчание ягнят (1991)",
                "Ганнибал (2001)"
],
            "Начало (2010)",
            "Одержимость (2019)",
            "Олдбой (2003)",
            "Особо опасен (2008)",
            "Первобытный страх (1996)",
            "Помни (2000)",
            "Сигнал (2007)",
            "Стрингер (2014)",
            "Тайна 7 сестёр (2017)",
            "Тёмные отражения (2018)",
            "Тоннель (2021)",
            "Убежище (2023)",
            "Убийца (2023)",
            "Шоссе в никуда (1997)"
],

        "Фэнтези": [
            "16 желаний (2010)",
            "Аквамарин (2006)",
            "Алиса в Стране чудес (2010)",
            "Амели (2001)",
            "Джуманджи": [
                "Джуманджи (1995)",
                "Джуманджи: Зов джунглей (2017)",
                "Джуманджи: Новый уровень (2019)",
                "Джуманджи 3 (2026)"
],
            "Доктор Дулиттл": [
                "Доктор Дулиттл (1967)",
                "Доктор Дулиттл (1998)",
                "Доктор Дулиттл 2 (2001)",
                "Доктор Дулиттл 3 (2006)",
                "Доктор Дулиттл: Хвост главы (2008)",
                "Доктор Дулиттл: Миллион собачьих долларов (2009)",
                "Удивительное путешествие доктора Дулиттла (2020)"
],
            "Загадочная история Бенджамина Баттона (2008)",
            "Заколдованная Элла (2004)",
            "Зачарованная (2007)",
            "Идеальная игрушка (2000)",
            "История Золушки (2004)",
            "Каспер (1995)",
            "Ключ от всех дверей (2005)",
            "Книга мастеров (2009)",
            "Колдунья (2005)",
            "Константин: Повелитель тьмы (2005)",
            "Лабиринт фавна (2006)",
            "Любовь сквозь время (2014)",
            "Мост в Терабитию (2007)",
            "Ноябрь (2017)",
            "Пенелопа (2006)",
            "Пираты Карибского моря": [
                "Пираты Карибского моря: Проклятие Черной жемчужины (2003)",
                "Пираты Карибского моря: Сундук мертвеца (2006)",
                "Пираты Карибского моря: На краю света (2007)",
                "Пираты Карибского моря: На странных берегах (2011)",
                "Пираты Карибского моря: Мертвецы не рассказывают сказки (2017)"
],
            "Принцесса льда (2005)",
            "Сказки на ночь (2008)",
            "Суини Тодд, демон-парикмахер с Флит-стрит (2007)",
            "Три мушкетёра (1993)",
            "Форма воды (2017)",
            "Хроники Нарнии": [
                "Хроники Нарнии: Лев, колдунья и платяной шкаф (2005)",
                "Хроники Нарнии: Принц Каспиан (2008)",
                "Хроники Нарнии: Покоритель Зари (2010)"
]
],

        "Хоррор": [
            "Адская пасть Мохаве (2022)",
            "Багровое пик (2025)",
            "Бархатная бензопила (2019)",
            "Гадкая сестра (2025)",
            "Гори, гори ясно (2019)",
            "Грешники (2025)",
            "Девятая сессия (2001)",
            "Дело ада: Исследователи потустороннего (2023)",
            "Живая кукла (2000)",
            "Злое (2021)",
            "Изгоняющий дьявола": [
                "Изгоняющий дьявола (1973)",
                "Изгоняющий дьявола 2 (1977)",
                "Изгоняющий дьявола 3 (1990)",
                "Изгоняющий дьявола: Начало (2004)",
                "Изгоняющий дьявола: Приквел (2005)",
                "Изгоняющий дьявола: Верующий (2023)"
],
            "Классическая история ужасов (2021)",
            "Крик": [
                "Крик (1996)",
                "Крик 2 (1997)",
                "Крик 3 (2000)",
                "Крик 4 (2011)",
                "Крик (2022)",
                "Крик 6 (2023)"
],
            "Кукушка (2024)",
            "Лестница Иакова (1990)",
            "Маребито (2004)",
            "Маяк (2019)",
            "Не говори никому (2024)",
            "Нецелитель (2020)",
            "Хранитель (2025)",
            "Ночные игры (2025)",
            "Одержимые злом (2023)",
            "Оно приходит за тобой (2014)",
            "Опоссум (2018)",
            "Плетёный человек (1973)",
            "Пришелец (2023)",
            "Пустой человек (2020)",
            "Пятница (2025)",
            "Собиратель душ (2024)",
            "Теке-теке (2009)",
            "Тихое место": [
                "Тихое место (2018)",
                "Тихое место 2 (2020)",
                "Тихое место 3 (2024)"
],
            "Только во сне (2025)",
            "У холмов есть глаза": [
                "У холмов есть глаза (1977)",
                "У холмов есть глаза 2 (1984)",
                "У холмов есть глаза (2006)",
                "У холмов есть глаза 2 (2007)"
],
            "Уиджи": [
                "Уиджи: Доска Дьявола (2014)",
                "Уиджи. Проклятие доски дьявола (2016)"
],
            "Улыбка": [
                "Улыбка (2022)",
                "Улыбка (2024)"
],
            "Эдем (2024)",
            "Эбигейл (2024)",
            "Паранормальное явление. Шум (2024)",
            "Парадокс Кловерфилда (2018)"
],

        "Экшн": [
            "Блэйд": [
                "Блэйд (1998)",
                "Блэйд 2 (2002)",
                "Блэйд 3: Троица (2004)"
],
            "Боец (2010)",
            "Васаби (2001)",
            "Городской охотник (1993)",
            "Дети шпионов": [
                "Дети шпионов (2001)",
                "Дети шпионов 2: Остров несбывшихся надежд (2002)",
                "Дети шпионов 3: Игра окончена (2003)",
                "Дети шпионов 4D (2011)",
                "Дети шпионов: Армагеддон (2023)"
],
            "Дом у дороги (2024)",
            "Если бы желания могли убивать (1991)",
            "Круэлла (2021)",
            "Леон (1994)",
            "Мистер и миссис Смит (2005)",
            "Святые из Бундока (1999)",
            "Славные парни (1990)",
            "Топ Ган: Маверик (2022)",
            "Форсаж": [
                "Форсаж (2001)",
                "Двойной форсаж (2003)",
                "Включай турбонаддув (2003)",
                "Тройной форсаж: Токийский дрифт (2006)",
                "Форсаж 4 (2009)",
                "Форсаж 5 (2011)",
                "Форсаж 6 (2013)",
                "Форсаж 7 (2015)",
                "Форсаж 8 (2017)",
                "Форсаж: Хоббс и Шоу (2019)",
                "Форсаж 9 (2021)",
                "Форсаж 10 (2023)",
                "Форсаж навсегда (2028)"
]
],

        "Sci-Fi": [
            "Аннигиляция (2018)",
            "Апокалипсис (2006)",
            "Вивариум (2019)",
            "Воспоминания о будущем (1995)",
            "Гаттака (1997)",
            "Джон Картер (2012)",
            "Знаки (2002)",
            "Пятый элемент (1997)",
            "Скользящие по небу (2009)",
            "Спасатели во времени (2008)",
            "Чужой": [
                "Прометей (2012)",
                "Чужой: Завет (2017)",
                "Чужой (1979)",
                "Чужой: Ромул (2024)",
                "Чужие (1986)",
                "Чужой 3 (1992)",
                "Чужой: Воскрешение (1997)"
]
]

    },


    "Мультфильмы": {

        "Комедия": [

            "Шрек": [
                "Шрек 1",
                "Шрек 2",
                "Шрек 3"
            ],

            "Мадагаскар": [
                "Мадагаскар 1",
                "Мадагаскар 2"
            ],

            "Кот в сапогах"

        ]

    },

    "Сериалы": {

        "Комедия": {

            "Лабубу": "Лабубу",
            "Алабуга политех": [
                "Бомбить Украину",
                "Строить дроны"
            ]
        }
    }

};



const app = document.getElementById("app");

let history = [];



function clear(){

    app.innerHTML = "";

}



function showHome(){

    history = [];


    let nav = document.querySelector(".navigation");

    if(nav){
        nav.remove();
    }


    clear();


    let title = document.createElement("h1");

    title.textContent = "Что сегодня посмотрим?";

    app.appendChild(title);



    for(let key in data){


        let button = document.createElement("button");

        button.textContent = key;


        button.onclick = () => {

            openData(data[key], data);

        };


        app.appendChild(button);

    }

}



function openData(content, saveHistory = true){


    if(saveHistory){

        history.push(content);

    }


    clear();



    if(Array.isArray(content)){


        content.forEach(item => {


            let div = document.createElement("div");


            div.className = "item";


            div.textContent = item;


            app.appendChild(div);


        });


    }


    else if(typeof content === "object"){


        for(let key in content){


            let value = content[key];


            if(typeof value === "string"){


                let div = document.createElement("div");


                div.className = "item";


                div.textContent = value;


                app.appendChild(div);


            }


            else{


                let button = document.createElement("button");


                button.textContent = key;


                button.onclick = () => openData(value);


                app.appendChild(button);


            }

        }


    }


    addNavigation();

}




function addNavigation(){


    let oldNav = document.querySelector(".navigation");


    if(oldNav){

        oldNav.remove();

    }



    let nav = document.createElement("div");

    nav.className = "navigation";



    let back = document.createElement("button");

    back.textContent = "⬅ Назад";



    back.onclick = () => {


    history.pop();


    let previous = history[history.length - 1];


    if(previous){


        openData(previous, false);


    }

    else{


        showHome();


    }


};



    let home = document.createElement("button");

    home.textContent = "🏠 Домой";


    home.onclick = showHome;



    nav.appendChild(back);

    nav.appendChild(home);



    document.body.insertBefore(

        nav,

        document.querySelector(".container")

    );


}



showHome();
